src/Documents/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<Comment>Рассылка сообщений</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииОтправкаSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки сообщений</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьНемедленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеUTF8</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистемаМессенджера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели сообщений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Comment>Ключ строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Comment>Номер телефон получателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель сообщения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СервисРассылки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
								<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтекСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата и время в которое необходимо отправлять сообщение</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправитьНемедленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияUTF8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКанала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыОтправки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефон получателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Comment>Ключ строки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДействия</Name>
					<Comment>Статус действия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Comment>Статус сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияДоставки</Name>
					<Comment>Стадия доставки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииДоставкиSMSСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Comment>Дата и время установки текущего статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата и время в которое необходимо отправлять сообщение</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСообщения</Name>
					<Comment>ID Сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефон получателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Comment>Ключ строки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыСообщенийИтоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСообщенийИтоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВОжидании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДоставлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОшибка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидОперацииОтправкаSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидОперацииОтправкаSMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МассоваяРассылкаSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаSMSПолучателю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПушУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мессенджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтадииДоставкиSMSСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиSMSСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРежимеДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеДоставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РассылкаСообщений/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция отправляет SMS-сообщение 
//
Функция СоздатьИПровестиДокументSMSРассылка(Получатель, НомерТелефона, Содержание, СообщениеОбОшибке = "", РежимЗаписи = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ПОПЫТКА
		
		SMSОтправка = Документы.РассылкаСообщений.СоздатьДокумент();
		SMSОтправка.Дата 			 	= ТекущаяДата();
		SMSОтправка.ВидОперации 		= Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю;
		SMSОтправка.СервисSMSРассылки 	= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
		SMSОтправка.ОтправитьНемедленно = Истина;
		SMSОтправка.Содержание 			= Содержание;
		SMSОтправка.Тип				    = Перечисления.ТипыСобытий.SMS;
		SMSОтправка.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
		
		НоваяСтрока 			  = SMSОтправка.Получатели.Добавить();
		НоваяСтрока.Получатель 	  = Получатель;
		НоваяСтрока.НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона);
		
		// SMSОтправка.Записать(РежимЗаписиДокумента.Проведение);
		SMSОтправка.Записать(?(РежимЗаписи <> Неопределено, РежимЗаписи, РежимЗаписиДокумента.Запись));
		
	ИСКЛЮЧЕНИЕ
		
		ЗаписьЖурналаРегистрации("SMS", УровеньЖурналаРегистрации.Ошибка, SMSОтправка.Метаданные(), SMSОтправка.Ссылка, ОписаниеОшибки());
		СообщениеОбОшибке = ОписаниеОшибки();
		
		Возврат Ложь;
		
	КОНЕЦПОПЫТКИ;
	
	Возврат Истина;
	
КонецФункции

// Функция - Отправляет сообщение SMS, Push и сообщение в мессенджер
//
// Параметры:
//  МассивСтруктурПолучателей	 - Массив с получателями сообщения 
//  Содержание					 - Текст сообщения 
//  СообщениеОбОшибке			 - Сообщение об ошибке 
//  ТипСобытия					 - Перечисление ТипыСобытий: СМС, Пуш или Мессенджер 
//  ВнешняяСистемаМессенджера	 - Внешняя система мессенджера, если отправка в мессенджер 
//  СтруктурнаяЕдиница			 - Структурная единица. Возьмет текущую, если неопределено 
// 
// Возвращаемое значение: Истина, если сообщение отправлено успешно, иначе ложь + сообщение с ошибкой
//
Функция СоздатьДокументSMSPushРассылкаИОтправить(
			МассивСтруктурПолучателей,
			Содержание,
			СообщениеОбОшибке = "",
			ТипСобытия,
			ВнешняяСистемаМессенджера = Неопределено,
			СтруктурнаяЕдиница = Неопределено) Экспорт
		
	ПОПЫТКА
		
		Если Не ПравоДоступа("Добавление", Метаданные.Документы.РассылкаСообщений) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для создания исходящего сообщения!");
			СообщениеОбОшибке = "Недостаточно прав для создания исходящего сообщения!"; 
			Возврат Ложь;
		КонецЕсли;
		
		SMSPushОтправка = Документы.РассылкаСообщений.СоздатьДокумент();
		
		ПолучателиЗаполнены = Ложь;
		Для Каждого СтруктураПолучателя Из МассивСтруктурПолучателей Цикл
			
			Получатель    = ?(СтруктураПолучателя.Свойство("Получатель"),СтруктураПолучателя.Получатель,Неопределено);
			НомерТелефона = ?(СтруктураПолучателя.Свойство("НомерТелефона"),СтруктураПолучателя.НомерТелефона,Неопределено); 
			Карта         = ?(СтруктураПолучателя.Свойство("Карта"),СтруктураПолучателя.Карта,Неопределено); 
			
			Если ЗначениеЗаполнено(Получатель)
				И (ЗначениеЗаполнено(НомерТелефона)
				Или ЗначениеЗаполнено(Карта)) Тогда
				
				НоваяСтрока = SMSPushОтправка.Получатели.Добавить();
				
				НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор();
				НоваяСтрока.Получатель = СтруктураПолучателя.Получатель;
				
				Если ТипСобытия <> Перечисления.ТипыСобытий.Мессенджер Тогда					
					
					Если ЗначениеЗаполнено(СтруктураПолучателя.НомерТелефона) Тогда 
						
						НоваяСтрока.НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтруктураПолучателя.НомерТелефона, Ложь);
						
					КонецЕсли;
					
				КонецЕсли;  
				
				ПолучателиЗаполнены = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПолучателиЗаполнены Тогда
			СообщениеОбОшибке = "Получатели не заполнены";
			Возврат Ложь;
		КонецЕсли;
		
		SMSPushОтправка.Дата 			 	= ТекущаяДатаСеанса();
		SMSPushОтправка.СтруктурнаяЕдиница	= ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		SMSPushОтправка.АвторДокумента	    = ПараметрыСеанса.ТекущийПользователь;
		SMSPushОтправка.Тип 				= ТипСобытия;
	
		Если ТипСобытия = Перечисления.ТипыСобытий.ПушУведомление Или ТипСобытия = Перечисления.ТипыСобытий.Мессенджер Тогда
			
			SMSPushОтправка.ВидОперации = Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю;
			SMSPushОтправка.ВнешняяСистемаМессенджера = ВнешняяСистемаМессенджера;
			
		ИначеЕсли ТипСобытия = Перечисления.ТипыСобытий.SMS Тогда	
			
			SMSPushОтправка.ВидОперации = Перечисления.ВидОперацииОтправкаSMS.МассоваяРассылкаSMS;
			SMSPushОтправка.СервисSMSРассылки 	= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
			
		КонецЕсли;
		
		SMSPushОтправка.ОтправитьНемедленно = Истина;
		SMSPushОтправка.Содержание 			= Содержание;
					                                                  
		SMSPushОтправка.Записать(РежимЗаписиДокумента.Проведение); // В оригинале = запись
		
	ИСКЛЮЧЕНИЕ
				
		СообщениеОбОшибке = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(Строка(ТипСобытия), УровеньЖурналаРегистрации.Ошибка, ?(SMSPushОтправка <> Неопределено, SMSPushОтправка.Метаданные(), ""), ?(SMSPushОтправка <> Неопределено, SMSPushОтправка.Ссылка, ""), СообщениеОбОшибке);
		
		Возврат Ложь;
		
	КОНЕЦПОПЫТКИ;
	
	Возврат Истина;
	
КонецФункции

Функция ПреобразоватьСодержаниеСПараметрамиВТекст(Знач Содержание, Документ, ПолучательSMS = Неопределено) Экспорт
	
	// Получаем значение параметров
	МассивПараметров = ПолучитьМассивПараметровИзШаблона(Содержание, "{}");
	Для Каждого Параметр Из МассивПараметров Цикл
		Результат = Неопределено;
		Попытка
			Выполнить("Результат = " + ВернутьПутьКРеквизитуПоПредставлении(Параметр));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно получить параметр (" + Параметр + ")" );
			Ошибка = Истина;
		КонецПопытки;
		Если Результат <> Неопределено Тогда
			Содержание = СтрЗаменить(Содержание, "{" + Параметр + "}", Результат);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Содержание;
	
КонецФункции

Функция ПолучитьМассивПараметровИзШаблона(ФормулаШаблона, ЗнакиВыделения = "{}")
	
	МассивПараметров = Новый Массив;
	
	НачалоПараметра = 0;
	КонецПараметра = 0;	
	Для а = 1 По СтрДлина(ФормулаШаблона) Цикл
		Если Сред(ФормулаШаблона, а, 1) = Сред(ЗнакиВыделения, 1, 1) Тогда
			НачалоПараметра = а + 1;
		ИначеЕсли Сред(ФормулаШаблона, а, 1) = Сред(ЗнакиВыделения, 2, 1) Тогда
			КонецПараметра = а - 1;			
		КонецЕсли;
		Если НачалоПараметра <> 0 И КонецПараметра <> 0 И (КонецПараметра - НачалоПараметра + 1) > 0 Тогда
			МассивПараметров.Добавить(Сред(ФормулаШаблона, НачалоПараметра, КонецПараметра - НачалоПараметра + 1));
			НачалоПараметра = 0;
			КонецПараметра = 0;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПараметров;
	
КонецФункции

Функция ВернутьПутьКРеквизитуПоПредставлении(Наименование)
	
	СписокПараметров = Новый СписокЗначений;
	СписокПараметров.Добавить("Фамилия", "ПолучательSMS.Фамилия");
	СписокПараметров.Добавить("Имя", "ПолучательSMS.Имя");
	СписокПараметров.Добавить("Отчество", "ПолучательSMS.Отчество");
	СписокПараметров.Добавить("ФИО", "ПолучательSMS.Наименование");
	СписокПараметров.Добавить("День", "Формат(Документ.ДокументОснование.Услуги[0].ДатаНачала, ""ДФ='dd MMMM'"")");
	СписокПараметров.Добавить("Время", "Формат(Документ.ДокументОснование.Услуги[0].ДатаНачала, ""ДФ=HH:mm"")");
	СписокПараметров.Добавить("День и время", "Формат(Документ.ДокументОснование.Услуги[0].ДатаНачала, ""ДФ='dd MMMM HH:mm'"")");
	СписокПараметров.Добавить("Сотрудник", "Документ.ДокументОснование.Услуги[0].Сотрудник");
	СписокПараметров.Добавить("Услуга", "Документ.ДокументОснование.Услуги[0].Номенклатура");
	СписокПараметров.Добавить("Структурная единица", "Документ.ДокументОснование.СтруктурнаяЕдиница");
	СписокПараметров.Добавить("Дата окончания срока действия полиса", "Формат(Документ.ДокументОснование.ДатаОкончания, ""ДФ='dd MMMM yyyy'"")");
			
	Результат = СписокПараметров.НайтиПоЗначению(Наименование);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат.Представление;
	Иначе
		Возврат Наименование;
	КонецЕсли;
	
КонецФункции

// Функция - Преобразовать содержание с параметрами в текст.
//
// Параметры:
//  ШаблонСообщения	 - 	 - 
//  Контрагент		 - 	 - 
//  Занятие			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьСодержимоеСПараметрамиВТекст(
	ШаблонСообщения,
	ДокументОснование) Экспорт
	
	ТаблицаПараметровШаблона = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();	

	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Событие") Тогда
		ЗаполнитьСодержаниеСПараметрамиРеквизитамиОбъекта(ШаблонСообщения, ДокументОснование, ТаблицаПараметровШаблона);
	КонецЕсли;
	
КонецФункции

// Процедура - Заполнить содержание с параметрами реквизитами объекта.
//
// Параметры:
//  ШаблонСообщения			 - 	 - 
//  ОбъектСсылка			 - 	 - 
//  ТаблицаПараметровШаблона - 	 - 
//
Процедура ЗаполнитьСодержаниеСПараметрамиРеквизитамиОбъекта(ШаблонСообщения, ОбъектСсылка, ТаблицаПараметровШаблона) 	 
	
	НайденныеСтроки = ТаблицаПараметровШаблона.НайтиСтроки(Новый Структура("ОбъектПараметра", ОбъектСсылка.Метаданные().Имя));
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		
		Если СтрокаТ.НаименованиеПараметра = "{ДатаЗаписи}" Тогда	
			
			ШаблонСообщения = СтрЗаменить(ШаблонСообщения, СтрокаТ.НаименованиеПараметра, Формат(ОбъектСсылка.Дата, "ДФ=dd.MM.yyyy"));   
			
		ИначеЕсли СтрокаТ.НаименованиеПараметра = "{ВремяНачалаЗаписьПриема}" Тогда
			
			ШаблонСообщения = СтрЗаменить(ШаблонСообщения, СтрокаТ.НаименованиеПараметра, Формат(ОбъектСсылка.Дата, "ДФ=HH:mm")); 
			
		ИначеЕсли СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемФИО}" ИЛИ СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемФамилия}" 
			ИЛИ СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемИмя}" ИЛИ СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемОтчество}" Тогда
			
			ФИОВрача = "";
			Если ЗначениеЗаполнено(ОбъектСсылка.Врач) Тогда
				Если СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемФИО}" Тогда
					ФИОВрача = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбъектСсылка.Врач, "Наименование");;
				ИначеЕсли СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемФамилия}" Тогда
					ФИОВрача = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбъектСсылка.Врач, "Фамилия");
				ИначеЕсли СтрокаТ.НаименованиеПараметра = "{ВрачЗаписиНаПриемИмя}" Тогда
					ФИОВрача = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбъектСсылка.Врач, "Имя"); 
				Иначе
					ФИОВрача = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбъектСсылка.Врач, "Отчество");
				КонецЕсли;
			КонецЕсли;
			ШаблонСообщения = СтрЗаменить(ШаблонСообщения, СтрокаТ.НаименованиеПараметра, ФИОВрача);			
			
		ИначеЕсли СтрокаТ.НаименованиеПараметра = "{СтатусЗаписи}" Тогда
			
			ШаблонСообщения = СтрЗаменить(ШаблонСообщения, СтрокаТ.НаименованиеПараметра, ОбъектСсылка.Статус);  
			
		ИначеЕсли СтрокаТ.НаименованиеПараметра = "{КлиникаЗаписи}" Тогда
			
			ШаблонСообщения = СтрЗаменить(ШаблонСообщения, СтрокаТ.НаименованиеПараметра, ОбъектСсылка.СтруктурнаяЕдиница);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для отправки сообщений и проверки их статуса при вызове регламентом.
//
Процедура ОтправкаОбновлениеСтатусовСообщений() Экспорт
	
	// Если фоновое задание уже запущено, то ничего не делаем.
	Если ФоновоеЗаданиеАктивно() Тогда
		Возврат;
	КонецЕсли;
	
	// Отправка SMS.
	// Ограничение - 10 сообщений в минуту.
	ОтправитьSMSИзСтека();
	
	// Обновляем статусы SMS.
	ОбновитьСтатусыSMS();
	
	// Отправка Сообщений в мессенджеры.
	// Ограничение - 10 сообщений в минуту.
	ОтправитьСообщенияВМессенджерыИзСтека();

	// Отправка Push-уведомлений.
	// Без ограничений.
	ОтправитьPushУведомленияКлиентаИзСтека();
	
КонецПроцедуры

// Процедура, выполняет отправку SMS сообщений.
//   
Процедура ОтправитьSMSИзСтека()
	
	// Устанавливаем привелигированный режим для фонового задания, вызываемого из документа.
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	// Выбор sms с приоритетом (коды подтверждения) и обычных sms сообщений.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	СтекСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СтекСообщений.КлючСтроки КАК КлючСтроки,
	|	СтекСообщений.СервисРассылки КАК СервисРассылки,
	|	СтекСообщений.ДатаОтправки КАК ДатаОтправки,
	|	СтекСообщений.ТекстСообщения КАК ТекстСообщения,
	|	СтекСообщений.Получатель КАК Получатель,
	|	СтекСообщений.НомерТелефона КАК НомерТелефона,
	|	ВЫБОР
	|		КОГДА СтекСообщений.ОтправитьНемедленно
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	СтекСообщений.КоличествоПопыток КАК КоличествоПопыток
	|ИЗ
	|	РегистрСведений.СтекСообщений КАК СтекСообщений
	|ГДЕ
	|	СтекСообщений.СервисРассылки ССЫЛКА Справочник.СервисыРассылки
	|	И ВЫБОР
	|			КОГДА НЕ СтекСообщений.ОтправитьНемедленно
	|				ТОГДА СтекСообщений.ДатаОтправки <= &ТекущаяДата
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ДатаОтправки");
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	ТаблицаSMSРассылок = Запрос.Выполнить().Выгрузить();
	
	МассивДокументовРассылки = Новый Массив;
	
	Для Каждого СтрокаSMS Из ТаблицаSMSРассылок Цикл
		
		УдалятьИзСтека		 = Ложь;
		КоличествоПопыток	 = СтрокаSMS.КоличествоПопыток;
		
		// Проверяем наличие текста сообщения.
		Если ЗначениеЗаполнено(СокрЛП(СтрокаSMS.ТекстСообщения)) Тогда
			
			// Отправляем SMS по одному, поскольку у каждого свой текст, сформированный из шаблона.
			МассивПолучатели = Новый Массив;
			МассивПолучатели.Добавить(СтрокаSMS.НомерТелефона);
			
			РезультатОтправкиSMSСообщений = Справочники.СервисыРассылки.ОтправитьSMSСообщения(СтрокаSMS.СервисРассылки, СтрокаSMS.ТекстСообщения, МассивПолучатели);
			
			СтрокаОтправки = РезультатОтправкиSMSСообщений.Найти(СтрокаSMS.НомерТелефона, "НомерТелефона");
			
			КоличествоПопыток = КоличествоПопыток + 1;
			
			Если СтрокаОтправки <> Неопределено Тогда				
				IDСообщения		 = СтрокаОтправки.IDСообщения;
				Статус			 = СтрокаОтправки.СтатусСообщения;
				СтадияДоставки	 = СтрокаОтправки.СтадияДоставки;
				УдалятьИзСтека	 = Истина;
			Иначе	
				IDСообщения    = "";
				Статус         = НСтр("ru = 'Ошибка: Сообщение не отправлено'; en = 'Error: Message not sent'");
				СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;				
			КонецЕсли; 			
		Иначе 	
			// Не пытаемся отправить, так как клиентам приходят пустые sms, происходит списание денег со счета отправителя.
			IDСообщения		 = "";
			Статус			 = НСтр("ru = 'Ошибка: Пустое сообщение'; en = 'Error: Empty message'");
			СтадияДоставки	 = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
			УдалятьИзСтека	 = Истина;
		КонецЕсли;
		
		// Фиксируем ID или ошибки в регистре.
		ЗаписьСтатусСообщения = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(ЗаписьСтатусСообщения, СтрокаSMS);
		
		ЗаписьСтатусСообщения.ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
		ЗаписьСтатусСообщения.IDСообщения          = IDСообщения;
		ЗаписьСтатусСообщения.СтатусСообщения      = Статус;
		ЗаписьСтатусСообщения.СтадияДоставки       = СтадияДоставки;
		
		ЗаписьСтатусСообщения.Записать(Истина);
		
		// Очистка стека сообщений.
		ЗаписьСтекаСообщений                   = РегистрыСведений.СтекСообщений.СоздатьМенеджерЗаписи();
		ЗаписьСтекаСообщений.РассылкаСообщений = СтрокаSMS.РассылкаСообщений;
		ЗаписьСтекаСообщений.КлючСтроки        = СтрокаSMS.КлючСтроки;
		ЗаписьСтекаСообщений.Прочитать();
		
		Если КоличествоПопыток < 3 И УдалятьИзСтека = Ложь Тогда
			ЗаписьСтекаСообщений.КоличествоПопыток = КоличествоПопыток;
			ЗаписьСтекаСообщений.Записать();
		Иначе
			ЗаписьСтекаСообщений.Удалить();
		КонецЕсли;
		
		Если МассивДокументовРассылки.Найти(СтрокаSMS.РассылкаСообщений) = Неопределено Тогда 
			МассивДокументовРассылки.Добавить(СтрокаSMS.РассылкаСообщений);
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновляем итоги по документам рассылки.
	Если МассивДокументовРассылки.Количество() > 0 Тогда
		ПересчитатьИтогиСтатусовСообщений(МассивДокументовРассылки);				
	КонецЕсли;  	
	
КонецПроцедуры

// Процедура, пересчитывает итоги статусов сообщений.
//
Процедура ПересчитатьИтогиСтатусовСообщений(МассивРассылок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРассылок", МассивРассылок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыSMSСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СУММА(ВЫБОР
	|			КОГДА СтатусыSMSСообщений.СтадияДоставки = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ВРежимеДоставки)
	|					ИЛИ СтатусыSMSСообщений.СтадияДоставки = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ПустаяСсылка)
	|						И СтатусыSMSСообщений.СтатусСообщения = """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВОжидании,
	|	СУММА(ВЫБОР
	|			КОГДА СтатусыSMSСообщений.СтадияДоставки = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.СообщениеДоставлено)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоставлено,
	|	СУММА(ВЫБОР
	|			КОГДА СтатусыSMSСообщений.СтадияДоставки = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ОшибкаДоставки)
	|					ИЛИ СтатусыSMSСообщений.СтадияДоставки = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ПустаяСсылка)
	|						И СтатусыSMSСообщений.СтатусСообщения <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОшибка
	|ИЗ
	|	РегистрСведений.СтатусыСообщений КАК СтатусыSMSСообщений
	|ГДЕ
	|	СтатусыSMSСообщений.РассылкаСообщений В(&МассивРассылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыSMSСообщений.РассылкаСообщений";
	
	ТаблицаИтогов = Запрос.Выполнить().Выгрузить();
	
	// Фиксируем итоги статусов в регистре.
	Для Каждого СтрокаТЧ из ТаблицаИтогов Цикл		
		ЗаписьСтатусыSMSСообщений = РегистрыСведений.СтатусыСообщенийИтоги.СоздатьМенеджерЗаписи();		
		ЗаполнитьЗначенияСвойств(ЗаписьСтатусыSMSСообщений, СтрокаТЧ);
		ЗаписьСтатусыSMSСообщений.Записать(Истина);				
	КонецЦикла; 
	
КонецПроцедуры

// Функция, выполянет проверку активности фоновых заданий смс рассылки.
//
Функция ФоновоеЗаданиеАктивно()
		
	// 1. Получаем массив фоновых заданий документа смс рассылки.
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Состояние", "Отправка смс, в отдельном потоке", СостояниеФоновогоЗадания.Активно));
	
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// 2. Получаем массив фоновых заданий регламента.		
	МассивФоновыхЗаданий  = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", "РегламентныеЗаданияСервер.ОбработкаSMSСообщений", СостояниеФоновогоЗадания.Активно)); 	
	
	Если МассивФоновыхЗаданий.Количество() > 1 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура, выполняет проверку статусов sms сообщений.
//
Процедура ОбновитьСтатусыSMS(ДокументРассылки = Неопределено) Экспорт

	// Устанавливаем привелигированный режим для фонового задания, вызываемого из документа.
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	// Подготавливаем данные, для проверки статусов.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	СтатусыSMSСообщений.СервисРассылки КАК СервисРассылки,
	|	СтатусыSMSСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СтатусыSMSСообщений.КлючСтроки КАК КлючСтроки,
	|	СтатусыSMSСообщений.IDСообщения КАК IDСообщения,
	|	СтатусыSMSСообщений.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	РегистрСведений.СтатусыСообщений КАК СтатусыSMSСообщений
	|ГДЕ
	|	СтатусыSMSСообщений.IDСообщения <> """"
	|	И СтатусыSMSСообщений.СервисРассылки ССЫЛКА Справочник.СервисыРассылки
	|	И СтатусыSMSСообщений.СтадияДоставки В (ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ВРежимеДоставки))
	|	И &УсловиеРассылкаСообщений
	|	И &УсловиеДатаУстановкиСтатуса
	|ИТОГИ ПО
	|	СервисРассылки");
	
	Запрос.УстановитьПараметр("ДатаНачалаОтбора"   , ТекущаяДатаСеанса() - (3*86400));
	Запрос.УстановитьПараметр("ДатаОкончанияОтбора", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("РассылкаСообщений"  , ДокументРассылки);

	// Если необходимо обновить статусы, только по конкретному документу.	
	Если ЗначениеЗаполнено(ДокументРассылки) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 100", "ВЫБРАТЬ");
	КонецЕсли;	
	
	УсловиеРассылкаСообщений    = ?(ЗначениеЗаполнено(ДокументРассылки), "И СтатусыSMSСообщений.РассылкаСообщений = &РассылкаСообщений", "");
	Запрос.Текст                = СтрЗаменить(Запрос.Текст, "И &УсловиеРассылкаСообщений", УсловиеРассылкаСообщений);

	УсловиеДатаУстановкиСтатуса = ?(Не ЗначениеЗаполнено(ДокументРассылки), "И НАЧАЛОПЕРИОДА(СтатусыSMSСообщений.ДатаУстановкиСтатуса, МИНУТА) МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора", "");
	Запрос.Текст                = СтрЗаменить(Запрос.Текст, "И &УсловиеДатаУстановкиСтатуса", УсловиеДатаУстановкиСтатуса);
	
	ВыборкаSMSСервисов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Создаем таблицу документов SMSРассылок, для обновления итогов.
	ТаблицаSMSрассылок = Новый ТаблицаЗначений;
	ТаблицаSMSрассылок.Колонки.Добавить("РассылкаСообщений", Новый ОписаниеТипов("ДокументСсылка.РассылкаСообщений"));
	
	Пока ВыборкаSMSСервисов.Следующий() Цикл
		
		ВыбокаСообщений = ВыборкаSMSСервисов.Выбрать();
		
		// 1. Формируем массив id сообщений.
		МассивПроверкиСтатусов = Новый Массив;		
		
		Пока ВыбокаСообщений.Следующий() Цикл
			МассивПроверкиСтатусов.Добавить(Новый Структура("IDСообщения, НомерТелефона", ВыбокаСообщений.IDСообщения, ВыбокаСообщений.НомерТелефона));			
		КонецЦикла;  
		
		// 2. Отправляем массив на получение текущих статусов.
		Если МассивПроверкиСтатусов.Количество() > 0 Тогда
			РезультатОтправкиSMSСообщений = Справочники.СервисыРассылки.ПолучитьСтатусыSMSСообщений(ВыборкаSMSСервисов.СервисРассылки, МассивПроверкиСтатусов);
		КонецЕсли;	
		
		// 3. Фиксируем статус или ошибки в регистре.
		ВыбокаСообщений.Сбросить();
		Пока ВыбокаСообщений.Следующий() Цикл
			
			НайденнаяСтрока = РезультатОтправкиSMSСообщений.Найти(ВыбокаСообщений.IDСообщения, "IDСообщения");
			Если НайденнаяСтрока <> Неопределено Тогда
				
				ЗаписьСтатусыSMSСообщений                   = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
				ЗаписьСтатусыSMSСообщений.РассылкаСообщений = ВыбокаСообщений.РассылкаСообщений;
				ЗаписьСтатусыSMSСообщений.КлючСтроки        = ВыбокаСообщений.КлючСтроки;						
				
				ЗаписьСтатусыSMSСообщений.Прочитать();
				
				ЗаписьСтатусыSMSСообщений.СтатусСообщения   = НайденнаяСтрока.СтатусСообщения;
				ЗаписьСтатусыSMSСообщений.СтадияДоставки    = НайденнаяСтрока.СтадияДоставки;
				
				ЗаписьСтатусыSMSСообщений.Записать(Истина);
				
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаSMSрассылок.Добавить();
			НоваяСтрока.РассылкаСообщений = ВыбокаСообщений.РассылкаСообщений;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 4. Обновляем итоги по документам SMS рассылки.
	Если ТаблицаSMSрассылок.Количество() > 0 Тогда
		ТаблицаSMSрассылок.Свернуть("РассылкаСообщений");
		ПересчитатьИтогиСтатусовСообщений(ТаблицаSMSрассылок.ВыгрузитьКолонку("РассылкаСообщений"));				
	КонецЕсли;  	
	
КонецПроцедуры

// Процедура, возвращает номера телефонов контрагентов.
//
Функция ПолучитьНомераТелефоновКонтрагентов(МассивПолучателей) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Ссылка КАК Получатель,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка В(&МассивПолучателей)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке
	|	И НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И КонтактнаяИнформация.НомерТелефона <> """"");
	
	Запрос.УстановитьПараметр("МассивПолучателей", МассивПолучателей);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает внешние системы, по которым доступна отправка в мессенджер.
//
Функция ПолучитьДоступныеДляОтправкиВнешниеСистемыМессенджера(Получатель, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВнешниеСистемыВсе
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистемВсе)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В (ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка), &СтруктурнаяЕдиница)
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВнешниеСистемыОтправитьПервым
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистемОтправитьПервым)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В (ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка), &СтруктурнаяЕдиница)
	|	И ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор,
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
	|	КонтактыМессенджеров.НомерМессенджера КАК НомерМессенджера,
	|	КонтактыМессенджеров.НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке,
	|	0 КАК ПорядокСортировки
	|ПОМЕСТИТЬ СуществующиеКонтакты
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешниеСистемыВсе КАК ВнешниеСистемыВсе
	|		ПО КонтактыМессенджеров.ВнешняяСистема = ВнешниеСистемыВсе.Ссылка
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &Получатель
	|	И НЕ КонтактыМессенджеров.ОбъектИдентификации В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Заявки.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемыОтправитьПервым.Ссылка КАК ВнешняяСистема,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерМессенджера,
	|	1 КАК ПорядокСортировки
	|ПОМЕСТИТЬ ДоступныеКонтакты
	|ИЗ
	|	ВнешниеСистемыОтправитьПервым КАК ВнешниеСистемыОтправитьПервым,
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Получатель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке
	|	И НЕ (ВнешниеСистемыОтправитьПервым.Ссылка, КонтактнаяИнформация.НомерТелефона) В
	|				(ВЫБРАТЬ
	|					СуществующиеКонтакты.ВнешняяСистема,
	|					СуществующиеКонтакты.НомерМессенджера
	|				ИЗ
	|					СуществующиеКонтакты КАК СуществующиеКонтакты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СуществующиеКонтакты.Идентификатор КАК ИдКлиента,
	|	СуществующиеКонтакты.ВнешняяСистема КАК ВнешняяСистема,
	|	СуществующиеКонтакты.ВнешняяСистема.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	СуществующиеКонтакты.ВнешняяСистема.Наименование КАК НаименованиеВнешнейСистемы,
	|	СуществующиеКонтакты.НомерМессенджера КАК НомерМессенджера,
	|	СуществующиеКонтакты.ПорядокСортировки КАК ПорядокСортировки
	|ИЗ
	|	СуществующиеКонтакты КАК СуществующиеКонтакты
	|ГДЕ
	|	СуществующиеКонтакты.НеУчаствоватьВРассылке = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ДоступныеКонтакты.ВнешняяСистема,
	|	ДоступныеКонтакты.ВнешняяСистема.ТипВнешнейСистемы,
	|	ДоступныеКонтакты.ВнешняяСистема.Наименование,
	|	ДоступныеКонтакты.НомерМессенджера,
	|	ДоступныеКонтакты.ПорядокСортировки
	|ИЗ
	|	ДоступныеКонтакты КАК ДоступныеКонтакты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСортировки");
	
	ТипыВнешнихСистемВсе			 = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();
	ТипыВнешнихСистемОтправитьПервым = Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым();
	
	Запрос.УстановитьПараметр("Получатель"						, Получатель);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"				, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТипыВнешнихСистемВсе"			, ТипыВнешнихСистемВсе);
	Запрос.УстановитьПараметр("ТипыВнешнихСистемОтправитьПервым", ТипыВнешнихСистемОтправитьПервым);
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Заявки") Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация",
			"Справочник.Заявки.КонтактнаяИнформация КАК КонтактнаяИнформация"
		);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Функция, создает и проводит документ РассылкаСообщений.
//
// Параметры:
// ПараметрыЗаполнения  - Структура - содержит:
//     * Содержание          - Строка                                                           - обязательный
//     * ОтправкаPush        - Булево                                                           - необязательный
//     * ОтправкаMessenger   - Булево                                                           - необязательный
//     * ОтправкаSMS         - Булево                                                           - необязательный
//     * ОтправитьНемедленно - Булево - только для важных сообщений, кодов подтверждений        - необязательный
//     * СтруктурнаяЕдиница  - СправочникСсылка.СтруктурныеЕдиницы                              - необязательный
//     * ДокументОснование   - ДокументСсылка, ДокументСсылка.Занятие, ДокументСсылка.Обращение - необязательный
//     * Сделка              - СправочникСсылка.Сделки                                          - необязательный
//     * НазначениеЗадачи    - Строка                                                           - необязательный
//     * Получатели - Массив структур - содержит:
//        ** Получатель    - СправочникСсылка.Контрагенты, СправочникСсылка.Сотрудники, СправочникСсылка.Заявки - обязательный
//        ** НомерТелефона - Строка - только для получателей sms                                                - необязательный
//  ОписаниеОшибки - Строка - возвращаемое описание ошибки при неудачном создании документа.
// 
// Возвращаемое значение:
//  Булево - Истина, при успешном создании документа рассылки сообщений.
//
Функция СоздатьДокументРассылкаСообщений(ПараметрыЗаполнения, ОписаниеОшибки = "", КруглосуточнаяОтправка = Истина) Экспорт
	
	Попытка
		
		ДокументРассылки = Документы.РассылкаСообщений.СоздатьДокумент();
		// Заполнение документа по-умолчанию.
		ДокументРассылки.Заполнить(Новый Структура());

		ДокументРассылки.Дата                = ТекущаяДатаСеанса();
		ДокументРассылки.Содержание          = ПараметрыЗаполнения.Содержание;
		ДокументРассылки.ОтправитьНемедленно = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ОтправитьНемедленно", Ложь);
		ДокументРассылки.СтруктурнаяЕдиница  = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "СтруктурнаяЕдиница" , ДокументРассылки.СтруктурнаяЕдиница);
		ДокументРассылки.ДокументОснование   = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ДокументОснование"	 , ДокументРассылки.ДокументОснование);
		// ДокументРассылки.Сделка              = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "Сделка"			 , ДокументРассылки.Сделка);
		// ДокументРассылки.НазначениеЗадачи    = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "НазначениеЗадачи"	 , ДокументРассылки.НазначениеЗадачи);
		ДокументРассылки.ДатаОтправки		 = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ДатаОтправки"	 	 , ?(ЗначениеЗаполнено(ДокументРассылки.ДатаОтправки), ДокументРассылки.ДатаОтправки, ТекущаяДатаСеанса()));
		Если НЕ КруглосуточнаяОтправка Тогда
			//НастройкиОтправки 		= Константы.НастройкиОтправкиСообщений.СведенияОНастройкахОтправкиСообщений();
			//ВремяНачалаОтправки 	= НачалоДня(ДокументРассылки.ДатаОтправки) + (Час(НастройкиОтправки.ВремяОтправкиСообщенийС) * 60 * 60) + (Минута(НастройкиОтправки.ВремяОтправкиСообщенийС) * 60);
			//ВремяОкончанияОтправки 	= НачалоДня(ДокументРассылки.ДатаОтправки) + (Час(НастройкиОтправки.ВремяОтправкиСообщенийПо) * 60 * 60) + (Минута(НастройкиОтправки.ВремяОтправкиСообщенийПо) * 60);
			//
			//Если (НастройкиОтправки.ВремяОтправкиСообщенийС = Дата(1, 1, 1) И НастройкиОтправки.ВремяОтправкиСообщенийПо = Дата(1, 1, 1)) 
			//	ИЛИ (ДокументРассылки.ДатаОтправки >= ВремяНачалаОтправки И ДокументРассылки.ДатаОтправки <= ВремяОкончанияОтправки) Тогда 
			//	// попали в разрешенный диапазон
			//ИначеЕсли ДокументРассылки.ДатаОтправки < ВремяНачалаОтправки Тогда 
			//	ДокументРассылки.ДатаОтправки = ВремяНачалаОтправки;
			//Иначе 
			//	ДокументРассылки.ДатаОтправки = ВремяНачалаОтправки + (24 * 60 * 60);
			//КонецЕсли;	
		КонецЕсли;	
		ДокументРассылки.ШаблонСообщения	 = ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ШаблонСообщения" 	 , ДокументРассылки.ШаблонСообщения);
		
		// Подготовка сервисов рассылки сообщений.
		СпособыРассылки = Новый Структура;
		СпособыРассылки.Вставить("ОтправкаMessenger", ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ОтправкаMessenger", Ложь));
		СпособыРассылки.Вставить("ОтправкаPush"		, ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ОтправкаPush"	  , Ложь));
		СпособыРассылки.Вставить("ОтправкаSMS"		, ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ОтправкаSMS"	  , Ложь));
		
		// Если не передано ни одного способа отправки сообщения.
		Если Не СпособыРассылки.ОтправкаMessenger И Не СпособыРассылки.ОтправкаSMS И Не СпособыРассылки.ОтправкаPush Тогда
			СпособыРассылки.ОтправкаMessenger	 = Истина;	
			СпособыРассылки.ОтправкаPush		 = Истина;	
			СпособыРассылки.ОтправкаSMS			 = Истина;	
		КонецЕсли;
		
		Если СпособыРассылки.ОтправкаPush Тогда
			ДокументРассылки.Тип = Перечисления.ТипыСобытий.ПушУведомление;
		КонецЕсли;
		
		Если СпособыРассылки.ОтправкаMessenger Тогда
			СпособыРассылки.ОтправкаMessenger = Справочники.ВнешниеСистемы.МессенджерИспользуется(ДокументРассылки.СтруктурнаяЕдиница);
			ДокументРассылки.Тип = Перечисления.ТипыСобытий.Мессенджер;
			Если ПараметрыЗаполнения.Свойство("ВнешняяСистема") Тогда
				ДокументРассылки.ВнешняяСистемаМессенджера = ПараметрыЗаполнения.ВнешняяСистема;
			КонецЕсли;
		КонецЕсли;
		
		Если СпособыРассылки.ОтправкаSMS Тогда
			
			СервисSMSРассылки = ДокументРассылки.СтруктурнаяЕдиница.СервисSMSРассылки;
			СервисSMSРассылки = ?(Не ЗначениеЗаполнено(СервисSMSРассылки), Константы.СервисSMSРассылкиПоУмолчанию.Получить(), СервисSMSРассылки);
			
			СпособыРассылки.ОтправкаSMS = ЗначениеЗаполнено(СервисSMSРассылки);
			ДокументРассылки.Тип = Перечисления.ТипыСобытий.SMS;
		КонецЕсли;
		
		// Если нет доступных сервисов отправки.
		Если Не СпособыРассылки.ОтправкаMessenger И Не СпособыРассылки.ОтправкаSMS И Не СпособыРассылки.ОтправкаPush Тогда
			ОписаниеОшибки = НСтр("ru='Нет доступных сервисов для отправки сообщения'; en='No services available to send a message'");
			Возврат Ложь;
		КонецЕсли;
		
		Для Каждого СтруктураПолучателя Из ПараметрыЗаполнения.Получатели Цикл
			
			Если Не ЗначениеЗаполнено(СтруктураПолучателя.Получатель) Тогда
				Продолжить;
			КонецЕсли;
			
			СервисРассылки = Неопределено;
			Получатель     = СтруктураПолучателя.Получатель;
			НомерТелефона  = ?(СтруктураПолучателя.Свойство("НомерТелефона"), СтруктураПолучателя.НомерТелефона, Неопределено);
			
			Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") 
				ИЛИ ТипЗнч(Получатель) = Тип("СправочникСсылка.Заявки") Тогда
				ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
			Иначе
				ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СервисРассылки) И СпособыРассылки.ОтправкаPush И ПараметрыЗаполнения.Свойство("СервисРассылки") Тогда
				СервисРассылки = ПараметрыЗаполнения.СервисРассылки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СервисРассылки) И Не ЗначениеЗаполнено(НомерТелефона)
				И (СпособыРассылки.ОтправкаMessenger ИЛИ СпособыРассылки.ОтправкаSMS) Тогда
				
				НомерТелефона = Справочники.Контрагенты.ПолучитьНомерТелефонаДляРассылки(Получатель, ВидКИ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СервисРассылки) И СпособыРассылки.ОтправкаMessenger Тогда
				
				СервисРассылки = ?(
					ПараметрыЗаполнения.Свойство("ВнешняяСистема"),
					ПараметрыЗаполнения.ВнешняяСистема,
					ПолучитьВнешнююСистемуМессенджераДляРассылки(
						Получатель,
						ДокументРассылки.СтруктурнаяЕдиница,
						ЗначениеЗаполнено(НомерТелефона) И ПолучитьЗначениеИзСтруктуры(ПараметрыЗаполнения, "ИнициироватьОтправку") = Истина
					)
				);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СервисРассылки) И СпособыРассылки.ОтправкаSMS И ЗначениеЗаполнено(НомерТелефона) Тогда
				СервисРассылки = СервисSMSРассылки;
			КонецЕсли;

			НоваяСтрока 			   = ДокументРассылки.Получатели.Добавить();
			НоваяСтрока.КлючСтроки     = Новый УникальныйИдентификатор();
			НоваяСтрока.Получатель 	   = Получатель;	
			НоваяСтрока.НомерТелефона  = НомерТелефона;
			НоваяСтрока.СервисРассылки = СервисРассылки; 
			
		КонецЦикла;
		
		// Передача дополнительных параметров при отправке из формы отправки сообщения.
		Если ПараметрыЗаполнения.Свойство("ПараметрыОтправки") И ЗначениеЗаполнено(ПараметрыЗаполнения.ПараметрыОтправки)
			И ДокументРассылки.Получатели.Количество() = 1 Тогда
			
			ДокументРассылки.ДополнительныеСвойства.Вставить("ПараметрыОтправки", ПараметрыЗаполнения.ПараметрыОтправки);
		КонецЕсли;
		
		// Если не заполнены получатели.
		Если ДокументРассылки.Получатели.Количество() = 0 Тогда
			ОписаниеОшибки = НСтр("ru='Не заполнены получатели сообщения или выбранный способ отправки недоступен';
								  |en='No message recipients selected or selected sending method is unavailable'");
			Возврат Ложь;
		КонецЕсли;
		
		ДокументРассылки.ВидОперации = ?(ДокументРассылки.Получатели.Количество() > 1, Перечисления.ВидОперацииОтправкаSMS.МассоваяРассылкаSMS, Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю);
		
		ДокументРассылки.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("РассылкаСообщений", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РассылкаСообщений,, ОписаниеОшибки);
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		Возврат ?(Структура.Свойство(Ключ), Структура[Ключ], ЗначениеПоУмолчанию);
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	
КонецФункции
   
// Функция - Получить сервис последнего использовавшегося мессенджера.
//
Функция ПолучитьВнешнююСистемуМессенджераДляРассылки(Получатель, СтруктурнаяЕдиница, ИнициироватьОтправку = Ложь, ВнешняяСистема = Неопределено) Экспорт
	
	ДоступныеТипыВнешнихСистем = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ПО КонтактыМессенджеров.Идентификатор = ЖурналСообщений.ИдКлиента
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &ОбъектИдентификации
	|	И НЕ КонтактыМессенджеров.НеУчаствоватьВРассылке
	|	И НЕ КонтактыМессенджеров.ВнешняяСистема.ПометкаУдаления
	|	И КонтактыМессенджеров.ВнешняяСистема.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|	И ЖурналСообщений.Мессенджер <> ЗНАЧЕНИЕ(Перечисление.Мессенджеры.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА КонтактыМессенджеров.ВнешняяСистема.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ КонтактыМессенджеров.ВнешняяСистема.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И КонтактыМессенджеров.ВнешняяСистема = &ВнешняяСистема
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналСообщений.ДатаСообщения УБЫВ";
	
	Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И КонтактыМессенджеров.ВнешняяСистема = &ВнешняяСистема", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъектИдентификации", Получатель);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТипыВнешнихСистем"  , ДоступныеТипыВнешнихСистем);
	Запрос.УстановитьПараметр("ВнешняяСистема"	   , ВнешняяСистема);
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВнешняяСистема;
	ИначеЕсли Не ИнициироватьОтправку = Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипыВнешнихСистем = Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке
	|ПОМЕСТИТЬ КонтактыМессенджеров
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО КонтактыМессенджеров.ОбъектИдентификации = КонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &Получатель
	|	И НЕ КонтактыМессенджеров.ВнешняяСистема.ПометкаУдаления
	|	И КонтактыМессенджеров.ВнешняяСистема.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона = КонтактыМессенджеров.НомерМессенджера
	|	И КонтактыМессенджеров.НомерМессенджера <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВнешниеСистемы.Ссылка КАК ВнешняяСистема
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО (КонтактыМессенджеров.ВнешняяСистема = ВнешниеСистемы.Ссылка)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ ВнешниеСистемы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|	И НЕ ЕСТЬNULL(КонтактыМессенджеров.НеУчаствоватьВРассылке, ЛОЖЬ)");
	
	Запрос.УстановитьПараметр("Получатель"			, Получатель);
	Запрос.УстановитьПараметр("ТипыВнешнихСистем"	, ТипыВнешнихСистем);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ВнешняяСистема, Неопределено);
	
КонецФункции

// Процедура, выполняет отправку Push-уведомлений.
//   
Процедура ОтправитьСообщенияВМессенджерыИзСтека()

	// Устанавливаем привелигированный режим для фонового задания, вызываемого из документа.
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДоступныеТипыВнешнихСистем = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();
	
	// Действует ограничение по отправке не более 10 сообщений в минуту,
	// для избежания блокировки аккаунта WhatsApp 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата"      , ТекущаяДатаСеанса());	
	Запрос.УстановитьПараметр("ТипыВнешнихСистем", ДоступныеТипыВнешнихСистем);	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 8
	|	СтекСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СтекСообщений.КлючСтроки КАК КлючСтроки,
	|	СтекСообщений.СервисРассылки КАК СервисРассылки,
	|	СтекСообщений.ДатаОтправки КАК ДатаОтправки,
	|	СтекСообщений.ТекстСообщения КАК ТекстСообщения,
	|	СтекСообщений.ТекстСообщенияUTF8 КАК ТекстСообщенияUTF8,
	|	СтекСообщений.Получатель КАК Получатель,
	|	СтекСообщений.НомерТелефона КАК НомерТелефона,
	|	СтекСообщений.ИдКанала КАК ИдКанала,
	|	СтекСообщений.ПараметрыОтправки КАК ПараметрыОтправки,
	|	ВЫБОР
	|		КОГДА СтекСообщений.ОтправитьНемедленно
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	СтекСообщений.КоличествоПопыток КАК КоличествоПопыток
	|ИЗ
	|	РегистрСведений.СтекСообщений КАК СтекСообщений
	|ГДЕ
	|	СтекСообщений.СервисРассылки ССЫЛКА Справочник.ВнешниеСистемы
	|	И ВЫРАЗИТЬ(СтекСообщений.СервисРассылки КАК Справочник.ВнешниеСистемы).ТипВнешнейСистемы В (&ТипыВнешнихСистем)
	|	И СтекСообщений.ДатаОтправки <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ДатаОтправки";
	
	ТаблицаСообщений = Запрос.Выполнить().Выгрузить();
	
	МассивДокументовРассылки = Новый Массив;
	
	Для Каждого СтрокаСообщения Из ТаблицаСообщений Цикл
		
		ИдСообщения			 = "";
		УдалятьИзСтека		 = Ложь;
		КоличествоПопыток	 = СтрокаСообщения.КоличествоПопыток;
		
		// Проверяем наличие текста сообщения.
		Если ЗначениеЗаполнено(СокрЛП(СтрокаСообщения.ТекстСообщения)) ИЛИ ЗначениеЗаполнено(СтрокаСообщения.ТекстСообщенияUTF8) Тогда
			ДополнительныеПараметры = Новый Структура("СообщениеЗакодировано", ЗначениеЗаполнено(СтрокаСообщения.ТекстСообщенияUTF8));
			
			#Если Не ВнешнееСоединение Тогда
				
				ПараметрыОтправки = СтрокаСообщения.ПараметрыОтправки.Получить();
				
				// Отправляем сообщения по одному, поскольку у каждого свой текст, сформированный из шаблона.			
				РезультатОтправки = МессенджерСтоматология.ОтправитьСообщениеКлиенту(
					?(ДополнительныеПараметры.СообщениеЗакодировано, СтрокаСообщения.ТекстСообщенияUTF8, СтрокаСообщения.ТекстСообщения),
					СтрокаСообщения.Получатель,
					СтрокаСообщения.СервисРассылки,
					СтрокаСообщения.НомерТелефона,
					СтрокаСообщения.ИдКанала,
					ДополнительныеПараметры,
					ПараметрыОтправки
				);
				
				КоличествоПопыток = КоличествоПопыток + 1;
				
				Если РезультатОтправки.ВыполненоУспешно Тогда
					ИдСообщения		 = РезультатОтправки.ИдСообщения;
					Статус			 = НСтр("ru = 'Сообщение доставлено'; en = 'Message delivered'");
					Статус			 = СокрЛП(Статус + " " + ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправки, "ОписаниеВторичнойОшибки", ""));
					СтадияДоставки	 = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
					УдалятьИзСтека	 = Истина;
				Иначе	
					Статус         = НСтр("ru = 'Ошибка: Сообщение не отправлено. '; en = 'Error: Message not sent. '") + РезультатОтправки.ОписаниеОшибки;
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
				КонецЕсли;
				
			#КонецЕсли
			
		Иначе 	
			// Не пытаемся отправить пустое сообщение.
			Статус			 = НСтр("ru = 'Ошибка: Пустое сообщение'; en = 'Error: Empty message'");
			СтадияДоставки	 = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
			УдалятьИзСтека	 = Истина;
		КонецЕсли;
		
		// Фиксируем ID или ошибки в регистре.
		ЗаписьСтатусСообщения = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(ЗаписьСтатусСообщения, СтрокаСообщения);
		
		ЗаписьСтатусСообщения.РассылкаСообщений    = СтрокаСообщения.РассылкаСообщений;
		ЗаписьСтатусСообщения.ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
		ЗаписьСтатусСообщения.IDСообщения          = ИдСообщения;
		ЗаписьСтатусСообщения.СтатусСообщения      = Статус;
		ЗаписьСтатусСообщения.СтадияДоставки       = СтадияДоставки;
		
		ЗаписьСтатусСообщения.Записать(Истина);
		
		// Очистка стека сообщений.
		ЗаписьСтекаСообщений                   = РегистрыСведений.СтекСообщений.СоздатьМенеджерЗаписи();
		ЗаписьСтекаСообщений.РассылкаСообщений = СтрокаСообщения.РассылкаСообщений;
		ЗаписьСтекаСообщений.КлючСтроки        = СтрокаСообщения.КлючСтроки;
		ЗаписьСтекаСообщений.Прочитать();
		
		Если КоличествоПопыток < 3 И УдалятьИзСтека = Ложь Тогда
			ЗаписьСтекаСообщений.КоличествоПопыток = КоличествоПопыток;
			ЗаписьСтекаСообщений.Записать();
		Иначе
			ЗаписьСтекаСообщений.Удалить();
		КонецЕсли;
		
		Если МассивДокументовРассылки.Найти(СтрокаСообщения.РассылкаСообщений) = Неопределено Тогда 
			МассивДокументовРассылки.Добавить(СтрокаСообщения.РассылкаСообщений);
		КонецЕсли;
	КонецЦикла;
	
	// Обновляем итоги по документам рассылки.
	Если МассивДокументовРассылки.Количество() > 0 Тогда
		ПересчитатьИтогиСтатусовСообщений(МассивДокументовРассылки);				
	КонецЕсли;  	
	
КонецПроцедуры

// Процедура, выполняет отправку Push-уведомлений.
//   
Процедура ОтправитьPushУведомленияКлиентаИзСтека()

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	СтекСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СтекСообщений.КлючСтроки КАК КлючСтроки,
	|	СтекСообщений.СервисРассылки КАК СервисРассылки,
	|	СтекСообщений.ДатаОтправки КАК ДатаОтправки,
	|	СтекСообщений.ТекстСообщения КАК ТекстСообщения,
	|	СтекСообщений.Получатель КАК Получатель,
	|	СтекСообщений.НомерТелефона КАК НомерТелефона,
	|	ВЫБОР
	|		КОГДА СтекСообщений.ОтправитьНемедленно
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	СтекСообщений.КоличествоПопыток КАК КоличествоПопыток
	|ИЗ
	|	РегистрСведений.СтекСообщений КАК СтекСообщений
	|ГДЕ
	|	СтекСообщений.СервисРассылки ССЫЛКА Справочник.ВнешниеСистемы
	|	И ВЫРАЗИТЬ(СтекСообщений.СервисРассылки КАК Справочник.ВнешниеСистемы).ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet)
	|	И СтекСообщений.ДатаОтправки <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ДатаОтправки");
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());	
	ТаблицаPushУведомлений = Запрос.Выполнить().Выгрузить();
	
	МассивДокументовРассылки = Новый Массив;
	
	ТаблицаУведомленийWallet = ПолучитьТаблицуУведомленийWallet(ТаблицаPushУведомлений);
	
	Если ТаблицаУведомленийWallet.Количество() > 0 Тогда 
		
		// Отправляем по 200, ограничение Wallet.
		Пока ТаблицаУведомленийWallet.Количество() > 200 Цикл
			
			ТаблицаУведомленийWalletВременная = Новый Массив;
			Для Индекс = 0 По 199 Цикл
				ТаблицаУведомленийWalletВременная.Добавить(ТаблицаУведомленийWallet[0]);
				ТаблицаУведомленийWallet.Удалить(0);
			КонецЦикла;
			
			ОтветСервера = Справочники.Карты.ОтправитьPushWallet(ТаблицаУведомленийWalletВременная);
			ОбработатьРезультатОтправкиPush(ОтветСервера, ТаблицаУведомленийWalletВременная, МассивДокументовРассылки);
			
		КонецЦикла;
		
		ОтветСервера = Справочники.Карты.ОтправитьPushWallet(ТаблицаУведомленийWallet);
		ОбработатьРезультатОтправкиPush(ОтветСервера, ТаблицаУведомленийWallet, МассивДокументовРассылки);
		
	КонецЕсли;
	
	// Обновляем итоги по документам рассылки.
	Если МассивДокументовРассылки.Количество() > 0 Тогда
		ПересчитатьИтогиСтатусовСообщений(МассивДокументовРассылки);				
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает таблицу уведомлений для отправки в Wallet.
//
Функция ПолучитьТаблицуУведомленийWallet(ТаблицаУведомлений)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаУведомлений.РассылкаСообщений КАК РассылкаСообщений,
	|	ТаблицаУведомлений.КлючСтроки КАК КлючСтроки,
	|	ТаблицаУведомлений.СервисРассылки КАК СервисРассылки,
	|	ТаблицаУведомлений.ДатаОтправки КАК ДатаОтправки,
	|	ТаблицаУведомлений.ТекстСообщения КАК ТекстСообщения,
	|	ТаблицаУведомлений.Получатель КАК Получатель,
	|	ТаблицаУведомлений.НомерТелефона КАК НомерТелефона,
	|	ТаблицаУведомлений.Приоритет КАК Приоритет,
	|	ТаблицаУведомлений.КоличествоПопыток КАК КоличествоПопыток
	|ПОМЕСТИТЬ ТаблицаУведомлений
	|ИЗ
	|	&ТаблицаУведомлений КАК ТаблицаУведомлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаУведомлений.РассылкаСообщений КАК РассылкаСообщений,
	|	ТаблицаУведомлений.КлючСтроки КАК КлючСтроки,
	|	ТаблицаУведомлений.СервисРассылки КАК СервисРассылки,
	|	ТаблицаУведомлений.ТекстСообщения КАК ТекстСообщения,
	|	ЕСТЬNULL(Карты.ВнутреннийКодКарты, """") КАК ВнутреннийКодКарты,
	|	ТаблицаУведомлений.КоличествоПопыток КАК КоличествоПопыток,
	|	ТаблицаУведомлений.Получатель КАК Получатель
	|ИЗ
	|	ТаблицаУведомлений КАК ТаблицаУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Карты КАК Карты
	|		ПО ТаблицаУведомлений.Получатель = Карты.ВладелецКарты
	|ГДЕ
	|	Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована");
	
	Запрос.УстановитьПараметр("ТаблицаУведомлений", ТаблицаУведомлений);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, обрабатывает результат отправки push-сообщений в Wallet.
//
Процедура ОбработатьРезультатОтправкиPush(ОтветОтСервера, ТаблицаУведомлений, МассивДокументовРассылки)
	
	Если ТипЗнч(ОтветОтСервера) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветОтСервера.Свойство("ОписаниеОшибки") И ЗначениеЗаполнено(ОтветОтСервера.ОписаниеОшибки) Тогда
		
		Для Каждого Уведомление Из ТаблицаУведомлений Цикл
			
			КоличествоПопыток = Уведомление.КоличествоПопыток + 1;
			
			IdPush = Неопределено;
			Стадия = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
			СтатусОтправки = "Ошибка доставки: " + ОтветОтСервера.ОписаниеОшибки;
					
			ЗаписатьСтатусСообщенияИОчиститьСтек(IdPush, Уведомление, Стадия, СтатусОтправки, КоличествоПопыток, Ложь);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаУведомлений.Колонки.Добавить("РезультатОтправки");
	
	Для Каждого Уведомление Из ТаблицаУведомлений Цикл
		Для Каждого Ответ Из ОтветОтСервера.data Цикл
			Если Ответ.Ключ = Уведомление.ВнутреннийКодКарты Тогда
				Уведомление.РезультатОтправки = Ответ.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Считаем сообщение отправленным успешно если оно дошло хотя бы на одну карту.
	Пока ТаблицаУведомлений.Количество() > 0 Цикл
		
		УспешноеУведомление	 = ТаблицаУведомлений[0];
		ТекущийКлюч			 = ТаблицаУведомлений[0].КлючСтроки;
		МассивУведомлений	 = ТаблицаУведомлений.НайтиСтроки(Новый Структура("КлючСтроки", ТекущийКлюч));
		ЕстьУспешнаяОтправка = Ложь;
		УдалятьИзСтека		 = Ложь;
		КоличествоПопыток	 = УспешноеУведомление.КоличествоПопыток + 1;
		
		Для Каждого Уведомление Из МассивУведомлений Цикл
			
			Если ЕстьУспешнаяОтправка = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Уведомление.РезультатОтправки) Тогда
				// Не пытаемся переотправить уведомление на несуществующую карту.
				УдалятьИзСтека	 = Истина;
				IdPush			 = Неопределено;
				Стадия			 = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
				СтатусОтправки	 = НСтр("ru = 'Не найдена электронная карта клиента'");
				
			ИначеЕсли Уведомление.РезультатОтправки["success"] = Истина Тогда
				IdPush			 = 1;
				Стадия			 = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено; 
				СтатусОтправки	 = НСтр("ru = 'Доставлено'");
				
				УдалятьИзСтека		 = Истина;
				ЕстьУспешнаяОтправка = Истина;
				УспешноеУведомление	 = Уведомление;
				
			Иначе
				IdPush			 = Неопределено;
				Стадия			 = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
				СтатусОтправки	 = НСтр("ru = 'Ошибка доставки: '") + Уведомление.РезультатОтправки["error"]["message"];
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписатьСтатусСообщенияИОчиститьСтек(IdPush, УспешноеУведомление, Стадия, СтатусОтправки, КоличествоПопыток, УдалятьИзСтека);
		
		Если МассивДокументовРассылки.Найти(УспешноеУведомление.РассылкаСообщений) = Неопределено Тогда
			МассивДокументовРассылки.Добавить(УспешноеУведомление.РассылкаСообщений);
		КонецЕсли;
		
		Для Каждого Уведомление Из МассивУведомлений Цикл
			ТаблицаУведомлений.Удалить(Уведомление);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, записывает статус сообщения и удаляет его из стека.
//
Процедура ЗаписатьСтатусСообщенияИОчиститьСтек(IDСообщения, PushУведомление, СтадияДоставки, Статус, КоличествоПопыток = 0, УдалятьИзСтека = Ложь)
		
	// Фиксируем ID или ошибки в регистре.
	ЗаписьСтатусСообщения = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(ЗаписьСтатусСообщения, PushУведомление);
	
	ЗаписьСтатусСообщения.РассылкаСообщений    = PushУведомление.РассылкаСообщений;
	ЗаписьСтатусСообщения.ДатаУстановкиСтатуса = ТекущаяДатаСеанса(); 
	ЗаписьСтатусСообщения.ДатаОтправки		   = ТекущаяДатаСеанса(); 
	ЗаписьСтатусСообщения.IDСообщения          = IDСообщения;
	ЗаписьСтатусСообщения.СтатусСообщения      = Статус;
	ЗаписьСтатусСообщения.СтадияДоставки       = СтадияДоставки;
	ЗаписьСтатусСообщения.Получатель           = PushУведомление.Получатель;
	
	ЗаписьСтатусСообщения.Записать();
	
	// Очистка стека сообщений.
	ЗаписьСтекаСообщений                   = РегистрыСведений.СтекСообщений.СоздатьМенеджерЗаписи();
	ЗаписьСтекаСообщений.РассылкаСообщений = PushУведомление.РассылкаСообщений;
	ЗаписьСтекаСообщений.КлючСтроки        = PushУведомление.КлючСтроки;
	ЗаписьСтекаСообщений.Прочитать();
	
	Если КоличествоПопыток < 3 И УдалятьИзСтека = Ложь Тогда
		ЗаписьСтекаСообщений.КоличествоПопыток = КоличествоПопыток;
		ЗаписьСтекаСообщений.Записать();
	Иначе
		ЗаписьСтекаСообщений.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
